# 1 задание
# f-строки:
a = float(input(" введите число: "))

print(f'{a: .1f}', "- округление до 1 знака")
print(f'{a: .2f}', "- округление до 2 знака")
print(f'{a: .3f}', "- округление до 3 знака")
# и т.д.

# без f-строки:
a = float(input(" введите число: "))

print("округление до 1 знака -", round(a, 1))
print("округление до 2 знака -", round(a, 2))
print("округление до 3 знака -", round(a, 3))
# и т.д.


# 2 задание
# f - строки:
a = float(input(" введите первое число: "))
b = float(input(" введите второе число: "))

c = (a + b) / 2
print("Среднее арифметическое =", f"{c}")

# без f-строк:
a = float(input(" введите первое число: "))
b = float(input(" введите второе число: "))

print("Среднее арифметическое=", round((a + b) / 2))
